# SQL

## Vorbereitung des Notebooks

Hier nichts verändern.

In [4]:
# Installiert Paket, damit man SQL-Befehle auf Dataframes anwenden kann
!pip install pandasql

# Lädt Paket, damit man Dataframes (Tabellen in Python) anwenden kann
import pandas as pd
# Lädt Paket, damit man SQL-Befehle auf Dataframes anwenden kann
import pandasql as ps

Collecting pandasql
  Downloading pandasql-0.7.3.tar.gz (26 kB)
  Preparing metadata (setup.py): started
  Preparing metadata (setup.py): finished with status 'done'
Requirement already satisfied: numpy in c:\users\hanne\appdata\local\packages\pythonsoftwarefoundation.python.3.10_qbz5n2kfra8p0\localcache\local-packages\python310\site-packages (from pandasql) (1.22.3)
Requirement already satisfied: pandas in c:\users\hanne\appdata\local\packages\pythonsoftwarefoundation.python.3.10_qbz5n2kfra8p0\localcache\local-packages\python310\site-packages (from pandasql) (1.4.2)
Collecting sqlalchemy
  Downloading SQLAlchemy-1.4.35-cp310-cp310-win_amd64.whl (1.6 MB)
     ---------------------------------------- 1.6/1.6 MB 401.2 kB/s eta 0:00:00
Requirement already satisfied: pytz>=2020.1 in c:\users\hanne\appdata\local\packages\pythonsoftwarefoundation.python.3.10_qbz5n2kfra8p0\localcache\local-packages\python310\site-packages (from pandas->pandasql) (2022.1)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\hanne\appdata\local\packages\pythonsoftwarefoundation.python.3.10_qbz5n2kfra8p0\localcache\local-packages\python310\site-packages (from pandas->pandasql) (2.8.2)
Collecting greenlet!=0.4.17
  Downloading greenlet-1.1.2-cp310-cp310-win_amd64.whl (101 kB)
     ------------------------------------ 102.0/102.0 KB 127.6 kB/s eta 0:00:00
Requirement already satisfied: six>=1.5 in c:\users\hanne\appdata\local\packages\pythonsoftwarefoundation.python.3.10_qbz5n2kfra8p0\localcache\local-packages\python310\site-packages (from python-dateutil>=2.8.1->pandas->pandasql) (1.16.0)
Using legacy 'setup.py install' for pandasql, since package 'wheel' is not installed.
Installing collected packages: greenlet, sqlalchemy, pandasql
  Running setup.py install for pandasql: started
  Running setup.py install for pandasql: finished with status 'done'
Successfully installed greenlet-1.1.2 pandasql-0.7.3 sqlalchemy-1.4.35

## Datenbeschreibung

Performance_data ist ein Datensatz über vorangegangene Leistungstests (VO2_max). Zudem enthält es Informationen über das Geschlecht und Alter der Untersuchten, ob diese rauchen oder nicht, deren Körpergröße und Gewicht, sowie die die Diagnostikerin, die den Test durchgeführt hat. Zudem wird der Erlös erhoben, der bei der Krankenkasse für die Diagnostik verrechnet wurde.

### Aufgabe

Laden die die Daten in einen pandas DataFrame und zeigen Sie diese an.

In [5]:
#laden der Daten in einem pandas Dataframe namens "performance_data"
performance_data = pd.read_csv("test_data.csv")

#Anzeigen performance_data
performance_data

,Unnamed: 0,VO2_max,age,smoker,height,weight,revenue,diagnostician_id,gender
0,0,45,66,True,165,76,30,2,Male
1,1,37,58,False,180,87,32,1,Female
2,2,54,27,False,155,62,29,0,Male
3,3,58,32,False,183,78,26,0,Male
4,4,45,75,True,166,101,10,2,Female
...,...,...,...,...,...,...,...,...,...
195,195,55,24,True,160,74,11,3,Male
196,196,46,17,False,172,92,18,3,Male
197,197,61,52,False,164,84,29,0,Female
198,198,67,46,True,164,78,39,1,Male
199,199,43,39,False,162,107,36,1,Male

In [6]:
# Lösung
# Lade die Daten in einen pandas Dataframe namens "performance_data"
performance_data = pd.read_csv("test_data.csv")

# Zeige performance_data an
performance_data

,Unnamed: 0,VO2_max,age,smoker,height,weight,revenue,diagnostician_id,gender
0,0,45,66,True,165,76,30,2,Male
1,1,37,58,False,180,87,32,1,Female
2,2,54,27,False,155,62,29,0,Male
3,3,58,32,False,183,78,26,0,Male
4,4,45,75,True,166,101,10,2,Female
...,...,...,...,...,...,...,...,...,...
195,195,55,24,True,160,74,11,3,Male
196,196,46,17,False,172,92,18,3,Male
197,197,61,52,False,164,84,29,0,Female
198,198,67,46,True,164,78,39,1,Male
199,199,43,39,False,162,107,36,1,Male

# Aufgaben

1. Was sind die höchsten drei Erlöse, die erzielt wurden?

In [11]:
ps.sqldf("""SELECT diagnostician_id, revenue
            FROM performance_data 
            ORDER BY revenue DESC LIMIT 3""")

   diagnostician_id  revenue
0                 1       49
1                 3       49
2                 2       49

2. Was sind die höchsten drei Erlöse, die mit Nicht-Rauchern erzielt wurden?

In [8]:
ps.sqldf("""SELECT age, smoker, revenue 
            FROM performance_data 
            WHERE smoker=False 
            ORDER BY revenue DESC LIMIT 3""")

   age  smoker  revenue
0   88       0       49
1   32       0       48
2   61       0       47

3. Wie leistungsfähig sind Personen mit Gewicht über 80kg verglichen mit leichteren Personen? (2 Befehle)

In [12]:
df1 = ps.sqldf("""SELECT AVG(VO2_max), AVG(weight) 
                  FROM performance_data
                  WHERE weight > 80""")

df2 = ps.sqldf("""SELECT AVG(VO2_max), AVG(weight) 
                  FROM performance_data
                  WHERE weight < 80""")

print(df1)
print(df2)

   AVG(VO2_max)  AVG(weight)
0     49.839623    95.660377
   AVG(VO2_max)  AVG(weight)
0     48.170455    68.965909

4. Was ist die Durchschnittsleistung von Frauen über 170cm?

In [13]:
ps.sqldf("""SELECT AVG(VO2_max), AVG(height), gender  
            FROM performance_data 
            WHERE gender='Female' AND height > 170""")

   AVG(VO2_max)  AVG(height)  gender
0     47.390244   179.170732  Female

5. Wie viel Umsatz haben die einzelnen Diagnostiker:innen erzielt?

In [14]:
ps.sqldf("""SELECT SUM(revenue) 
            FROM performance_data 
            GROUP BY diagnostician_id""")

   SUM(revenue)
0          1012
1          1494
2          1562
3          1708

6. Wie ist die durchschnittliche Leistung von Rauchern und Nicht-Rauchern, die von den Diagnostiker:innen 0 und 1 betreut wurden.

In [15]:
df_diag_0 = ps.sqldf("""SELECT AVG(VO2_max), diagnostician_id, smoker 
                        FROM performance_data 
                        WHERE diagnostician_id=0
                        GROUP BY smoker""")


df_diag_1 = ps.sqldf("""SELECT AVG(VO2_max), diagnostician_id, smoker 
                        FROM performance_data 
                        WHERE diagnostician_id=1
                        GROUP BY smoker""")

print(df_diag_0)
print(df_diag_1)

   AVG(VO2_max)  diagnostician_id  smoker
0     48.789474                 0       0
1     51.647059                 0       1
   AVG(VO2_max)  diagnostician_id  smoker
0        49.375                 1       0
1        48.000                 1       1